---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalyticalMember..::..SetMemberForces Method
AnalyticalMember Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | SetMemberForces(MemberForces) | Sets Member Forces to Analytical Member. |
|  | SetMemberForces(Boolean, XYZ, XYZ) | Sets Member Forces to Analytical Member. |

# See Also

AnalyticalMember Class

AnalyticalMember Members

Autodesk.Revit.DB.Structure Namespace